tutorials/rotatingSlit/0/CA
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      CA;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
CAin   5.00;
CA0    5.00;

dimensions      [ 1 -3 0 0 0 0 0 ];

internalField   uniform $CA0;

boundaryField
{
    membraneA
    {
         type    zeroGradient;
        // type    membraneSoluteFlux;
        // model   intrinsicRejection;
        // Rint    1.0;
        // UName   U;
        // value   uniform 0;

        // type    membraneSoluteFlux;
        // model   solutePermeability;
        // B       1e-12;
        // sigma   1;      // inherit from solvent BC on U (or give a number, e.g. 0.9)
        // UName   U;
        // value   uniform 0;
    }
    membraneB
    {
        type    membraneSoluteFlux;
        model   intrinsicRejection;
        Rint    0.99;
        UName   U;
        CAb     1.0;     // required only when writeRobs=yes
        value   uniform 0;

        // type    membraneSoluteFlux;
        // model   observedRejection;
        //
        // Robs        0.8;
        // CAb         1.0;
        //
        // UName   U;
        // value   uniform 0;


        // type    membraneSoluteFlux;
        // model   solutePermeability;
        // B       1e-6;
        // sigma   1;      // inherit from solvent BC on U (or give a number, e.g. 0.9)
        // UName   U;
        // CAb     $CA0;
        // value   uniform 0;
    }
    inlet
    {
        type            fixedValue;
        value           uniform $CAin;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetry;
    }

}

// ************************************************************************* //
