tutorials/rotatingSlit/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     centriMembSolver;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         30;

deltaT          0.005;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

runTimeModifiable yes;

adjustTimeStep  yes;
                        
maxCo       10;
maxDeltaT   0.1;

// DebugSwitches
// {
//     membraneSoluteFlux 1;
//     CAViscosity 1;
// }

libs ("libGamaPatchAvgTimeWindow.so");

functions
{
    GamaPatchAvgTimeWindow1
    {
        type        GamaPatchAvgTimeWindow;

        // --- settings ---
        patchName   membraneB;
        fieldName   Gama;
        timeWindow  15;

        // --- output control ---
        masterOnly  true;
        writeControl timeStep;   // usa writeTime => remove isto OU muda para timeStep
        writeInterval 1;
        log         true;

        // optional naming
        outputName  Gama_membrane_avgWin;
        fileName    areaAvg_timeWindow.dat;
    }


    // // --- your existing WSS bits (kept, just minor tidy) ---
    // wss
    // {
    //     type            wallShearStress;
    //     libs            ("libfieldFunctionObjects.so");
    //     patches         ("membraneB");
    //     writeControl    writeTime;
    // }
    //
    // wssMag
    // {
    //     type            mag;
    //     libs            ("libfieldFunctionObjects.so");
    //     field           wallShearStress;     // input vector field
    //     result          wallShearStressMag;  // output scalar field
    //     writeControl    writeTime;
    //     writeFields     yes;
    // }
    //
    // wssAvg
    // {
    //     type            surfaceFieldValue;
    //     libs            ("libfieldFunctionObjects.so");
    //     regionType      patch;
    //     name            membraneB;
    //     operation       areaAverage;
    //     fields          (wallShearStressMag);
    //     log             yes;
    //     writeFields     no;
    //     writeControl    writeTime;
    // }
    // MÉDIA DE ÁREA de p_rgh no patch membraneB

}

// ************************************************************************* //
